Tekla.Structures.Drawing.PreferredSymbolPlacingTypes
The PreferredSymbolPlacingTypes class contains the available preferred symbol placing types.
These are allowed to be used for symbols.

Tekla.Structures.Drawing.PreferredSymbolPlacingTypes.PointPlacingType
The object is placed at one point (the insertion point) without any additional placing options.
Returns: A new point placing type instance.

Tekla.Structures.Drawing.PreferredSymbolPlacingTypes.LeaderLinePlacingType
The object is placed with a leader line.
Returns: A new leader line placing type instance.

Tekla.Structures.Drawing.PreferredSymbolPlacingTypes.AlongLinePlacingType
The object is placed using the along line placing.
Returns: A new along line placing type instance.